Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་རྣམས་དང་ཏིང་ངེ་འཛིན་རྣམས་དང་གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་མ་སྐྱེས་པ་མཐོང་བར་འགྱུར།
en: Owing to their utter purity, they do observe the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas.

source: ཤིན་དུ་རྣམ་པར་དག་པའི་སླད་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་མ་སྐྱེས་པ་མཐོང་བར་འགྱུར། ཤིན་དུ་རྣམ་པར་དག་པའི་སླད་དུ།
en: Owing to their utter purity, they do observe the nonarising of [the spiritual goals], up to and including all-aspect omniscience.

source: སོ་སོའི་སྐྱེ་བོའི་མ་སྐྱེས་པ་མཐོང་བར་འགྱུར། ཤིན་དུ་རྣམ་པར་དག་པའི་སླད་དུ།
en: Owing to their utter purity, they do observe the nonarising of ordinary persons.

source: སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་ཀྱི་མ་སྐྱེས་པ་མཐོང་བར་འགྱུར། ཤིན་དུ་རྣམ་པར་དག་པའི་སླད་དུ།
en: Owing to their utter purity, they do observe the nonarising of the attributes of ordinary persons.

source: རྒྱུན་དུ་ཞུགས་པ་དང་རྒྱུན་དུ་ཞུགས་པའི་ཆོས་རྣམས་ཀྱི་མ་སྐྱེས་པ་མཐོང་བར་འགྱུར། ཤིན་དུ་རྣམ་པར་དག་པའི་སླད་དུ། ལན་ཅིག་ཕྱིར་འོང་བ་དང་།
en: Owing to their utter purity, they do observe the nonarising of those who have entered the stream to nirvāṇa and of the attributes of those who have entered the stream to nirvāṇa.

source: ལན་ཅིག་ཕྱིར་འོང་བའི་ཆོས་རྣམས་དང་ཕྱིར་མི་འོང་བ་དང་ཕྱིར་མི་འོང་བའི་ཆོས་རྣམས་དང་། དགྲ་བཅོམ་པ་དང་དགྲ་བཅོམ་པའི་ཆོས་རྣམས་དང་། རང་སངས་རྒྱས་དང་རང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྣམས་དང་། སངས་རྒྱས་ཀྱི་མ་སྐྱེས་པ་མཐོང་བར་འགྱུར།
en: Owing to their utter purity, they do observe the nonarising of those who are destined for only one more rebirth, of the attributes of those who are destined for only one more rebirth, of those who are no longer subject to rebirth, of the attributes of those who are no longer subject to rebirth, of the arhats, of the attributes of the arhats, of the pratyekabuddhas, of the attributes of the pratyekabuddhas, of the bodhisattvas, of the attributes of the bodhisattvas, and of the buddhas.

source: ཤིན་དུ་རྣམ་པར་དག་པའི་སླད་དུ། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་མ་སྐྱེས་པ་མཐོང་བར་འགྱུར་རོ།
en: Owing to their utter purity, they do observe the nonarising of the attributes of the buddhas.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་སྨྲས་པའི་དོན་བདག་གིས་ཤེས་པ་ལྟར་ན།
en: The venerable Śāradvatīputra then addressed the venerable Subhūti as follows: “Venerable Subhūti, as I understand the meaning of your words, physical forms are indeed nonarising.

source: གཟུགས་ཀྱང་མ་སྐྱེས་ལ་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་མ་སྐྱེས།
en: Feelings, perceptions, formative predispositions, and consciousness are also nonarising.

source: སྐྱེ་མཆེད་རྣམས་ཀྱང་མ་སྐྱེས།
en: The sense fields are also nonarising.

source: ཁམས་རྣམས་ཀྱང་མ་སྐྱེས།
en: The sensory elements are also nonarising.

source: རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་རྣམས་ཀྱང་མ་སྐྱེས།
en: The links of dependent origination are also nonarising.

source: ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་ཀྱང་མ་སྐྱེས།
en: The perfections are also nonarising.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་ཀྱང་མ་སྐྱེས།
en: All the aspects of emptiness are also nonarising.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཡང་མ་སྐྱེས།
en: The thirty-seven factors of enlightenment are also nonarising.

source: འཕགས་པའི་བདེན་པ་རྣམས་དང་བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ཀྱང་མ་སྐྱེས།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions are also nonarising.

source: རྣམ་པར་ཐར་བ་རྣམས་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་ཡང་མ་སྐྱེས། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱང་མ་སྐྱེས།
en: The aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways are also nonarising.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱང་མ་སྐྱེས།
en: The powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are also nonarising. [

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཡང་མ་སྐྱེས།
en: The spiritual goals], up to and including all-aspect omniscience, are also nonarising.

source: སོ་སོའི་སྐྱེ་བོ་ཡང་མ་སྐྱེས།
en: Ordinary persons are also nonarising.

source: སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་ཀྱང་མ་སྐྱེས།
en: The attributes of ordinary persons are also nonarising.

source: རྒྱུན་དུ་ཞུགས་པ་ཡང་མ་སྐྱེས།
en: Those who have entered the stream to nirvāṇa are also nonarising.

source: རྒྱུན་དུ་ཞུགས་པའི་ཆོས་ཀྱང་མ་སྐྱེས།
en: The attributes of those who have entered the stream to nirvāṇa are also nonarising.

source: ལན་ཅིག་ཕྱིར་འོང་བ་ཡང་མ་སྐྱེས།
en: Those who are destined for only one more rebirth are also nonarising.

source: ལན་ཅིག་ཕྱིར་འོང་བའི་ཆོས་ཀྱང་མ་སྐྱེས་ཕྱིར་མི་འོང་བ་ཡང་མ་སྐྱེས།
en: The attributes of those who are destined for only one more rebirth are also nonarising. Those who are no longer subject to rebirth are also nonarising.

source: ཕྱིར་མི་འོང་བའི་ཆོས་ཀྱང་མ་སྐྱེས།
en: The attributes of those who are no longer subject to rebirth are also nonarising.

source: དགྲ་བཅོམ་པ་ཡང་མ་སྐྱེས།
en: The arhats are also nonarising.

source: དགྲ་བཅོམ་པའི་ཆོས་ཀྱང་མ་སྐྱེས།
en: The attributes of the arhats are also nonarising.

source: རང་སངས་རྒྱས་ཀྱང་མ་སྐྱེས།
en: The pratyekabuddhas are also nonarising.

source: རང་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱང་མ་སྐྱེས།
en: The attributes of the pratyekabuddhas are also nonarising.

source: བྱང་ཆུབ་སེམས་དཔའ་ཡང་མ་སྐྱེས།
en: The bodhisattvas are also nonarising.

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱང་མ་སྐྱེས།
en: The attributes of the bodhisattvas are also nonarising.

source: སངས་རྒྱས་ཀྱང་མ་སྐྱེས།
en: The buddhas are also nonarising.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཀྱང་མ་སྐྱེས་པ་ཡིན་ན།
en: The attributes of the buddhas are also nonarising.

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེ་ལྟར་གལ་ཏེ་གཟུགས་ཀྱང་སྐྱེ་བ་མེད། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་ཡང་སྐྱེ་བ་མེད། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཡང་སྐྱེ་བ་མེད། སོ་སོའི་སྐྱེ་བོ་ཡང་སྐྱེ་བ་མེད། སོ་སོའི་སྐྱེ་བོའི་ཆོས་ཀྱང་སྐྱེ་བ་མེད། རྒྱུན་དུ་ཞུགས་པ་དང་རྒྱུན་དུ་ཞུགས་པའི་ཆོས་ཀྱང་སྐྱེ་བ་མེད། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་ཆོས་ཀྱང་སྐྱེ་བ་མེད། ཕྱིར་མི་འོང་བ་དང་ཕྱིར་མི་འོང་བའི་ཆོས་ཀྱང་སྐྱེ་བ་མེད། དགྲ་བཅོམ་པ་དང་དགྲ་བཅོམ་པའི་ཆོས་ཀྱང་སྐྱེ་བ་མེད། རང་སངས་རྒྱས་དང་རང་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱང་སྐྱེ་བ་མེད། བྱང་ཆུབ་སེམས་དཔའ་ཡང་སྐྱེ་བ་མེད། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱང་སྐྱེ་བ་མེད། སངས་
en: If that is so, Venerable Subhūti—if physical forms do not arise; if [all phenomena, and all the causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, also do not arise; if [the spiritual goals], up to and including all-aspect omniscience, also do not arise; if ordinary persons also do not arise; if the attributes of ordinary persons also do not arise; if those who have entered the stream to nirvāṇa and their attributes also do not arise; if those who are destined for only one more rebirth and their attributes also do not arise; if those who are no longer subject to rebirth and their attributes also do not arise; if the arhats and their attributes also do not arise; if the pratyekabuddhas and their attributes also do not arise; if the bodhisattvas and their attributes also do not arise; and if the buddhas and their attributes also do not arise—then indeed those who follow the vehicle of the śrāvakas would have already attained the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, and arhatship.

source: རྒྱས་ཀྱང་སྐྱེ་བ་མེད། སངས་རྒྱས་ཀྱི་ཆོས་ཀྱང་སྐྱེ་བ་མེད་ན་ནི། ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱིས་ཀྱང་། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་ཟིན་པར་འགྱུར་རོ། །རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱིས་ཀྱང་། རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཐོབ་ཟིན་པར་འགྱུར་རོ།
en: Those who follow the vehicle of the pratyekabuddhas, too, would have already attained their individual enlightenment.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཀྱང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་ཟིན་པར་འགྱུར་རོ།
en: Also, bodhisattva great beings would have already attained all-aspect omniscience.

source: །འགྲོ་བ་ལྔ་རྣམས་ཀྱང་ཐ་མི་དད་པར་འགྱུར་རོ།
en: The five classes of living beings would not even be differentiated.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཀྱང་བྱང་ཆུབ་རྣམ་ལྔ་ཐོབ་ཟིན་པར་འགྱུར་རོ།
en: Bodhisattva great beings would have already attained the five degrees of enlightenment. “

source: །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གལ་ཏེ་ཆོས་ཐམས་ཅད་མ་སྐྱེས་པ་ཡིན་ན། ཅིའི་ཕྱིར་རྒྱུན་དུ་ཞུགས་པས་ནི། ཀུན་དུ་སྦྱོར་བ་གསུམ་སྤང་བའི་ཕྱིར་ལམ་བསྒོམས།
en: Venerable Subhūti, if all phenomena are nonarising, why should those entering the stream to nirvāṇa {Dt.260} cultivate the path in order to abandon the three fetters?

source: ལན་ཅིག་ཕྱིར་འོང་བས་ནི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་གཏི་མུག་བསྲབས་པའི་ཕྱིར་ལམ་བསྒོམས།
en: Why should those destined for only one more rebirth cultivate the path in order to attenuate desire, hatred, and delusion?

source: ཕྱིར་མི་འོང་བས་ནི། དམ་པ་མ་ཡིན་པའི་ཆ་ཅན་གྱི། ཀུན་དུ་སྦྱོར་བ་ལྔ་སྤང་བའི་ཕྱིར་ལམ་བསྒོམས།
en: Why should those no longer subject to rebirth cultivate the path in order to abandon the five fetters associated with the lower realms?

source: དགྲ་བཅོམ་པས་ནི་བླ་མའི་ཆ་ཅན་གྱི། ཀུན་དུ་སྦྱོར་བ་རྣམས་སྤང་བའི་ཕྱིར་ལམ་བསྒོམས།
en: Why should arhats cultivate the path in order to abandon the five fetters associated with the higher realms?

source: རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་ཞུགས་པས་ནི། རང་བྱང་ཆུབ་ཀྱི་དོན་དུ་ལམ་བསྒོམས།
en: Why should followers of the vehicle of the pratyekabuddhas cultivate the path for the sake of individual enlightenment?

source: ཅིའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི། སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་དེ་ལྟར་སྡུག་བསྔལ་ཉམས་སུ་མྱོང་བར་བྱེད་ཅིང་དཀའ་བའི་སྤྱད་པ་སྤྱོད་ཅིང་།
en: Why should bodhisattva great beings practice austerity and undergo sufferings for the sake of beings?

source: ཅིའི་ཕྱིར་དེ་བཞིན་གཤེགས་པས་ནི། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Why should the tathāgatas attain consummate buddhahood in unsurpassed, complete enlightenment?

source: ཅིའི་ཕྱིར་དེ་བཞིན་གཤེགས་པས་ནི། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར། དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: Why should the tathāgatas turn the wheel of the Dharma?”

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བདག་ནི་ཆོས་མ་སྐྱེས་པ་ལ་འཐོབ་པ་ཡོད་པ་དང་། ཁོང་དུ་ཆུད་པ་ཡོད་པར་མི་འདོད་དོ།
en: The venerable Subhūti then replied to the venerable Śāradvatīputra as follows: “Venerable Śāradvatīputra, I do not hold that nonarising phenomena have attainments or comprehension.

source: །མ་སྐྱེས་པ་ལ་རྒྱུན་དུ་ཞུགས་པ་ཡོད་པར་མི་འདོད་དོ། །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཡོད་པར་མི་འདོད་དོ།
en: I do not hold that in nonarising there are individuals entering the stream to nirvāṇa, nor do I hold that the fruit of entering the stream to nirvāṇa is to be actualized in it.

source: །མ་སྐྱེས་པ་ལ་ལན་ཅིག་ཕྱིར་འོང་བ་ཡོད་པར་མི་འདོད་དོ། །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ཡོད་པར་མི་འདོད་དོ།
en: I do not hold that in nonarising there are individuals destined for only one more rebirth, nor do I hold that the fruit of being destined for only one more rebirth is to be actualized in it.

source: །མ་སྐྱེས་པ་ལ་ཕྱིར་མི་འོང་བ་ཡོད་པར་མི་འདོད་དོ། །ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ཡོད་པར་མི་འདོད་དོ།
en: I do not hold that in nonarising there are individuals no longer subject to rebirth, nor do I hold that the fruit of no longer being subject to rebirth is to be actualized in it.

source: །མ་སྐྱེས་པ་ལ་དགྲ་བཅོམ་པ་ཡོད་པར་མི་འདོད་དོ། །དགྲ་བཅོམ་པ་ཉིད་མངོན་དུ་བྱ་བ་ཡོད་པར་མི་འདོད་དོ།
en: I do not hold that in nonarising there are arhats, nor do I hold that arhatship is to be actualized in it.

source: །མ་སྐྱེས་པ་ལ་རང་སངས་རྒྱས་ཡོད་པར་མི་འདོད་དོ། །རང་བྱང་ཆུབ་ཡོད་པར་མི་འདོད་དོ།
en: I do not hold that in nonarising there are pratyekabuddhas, nor do I hold that individual enlightenment is to be actualized in it. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བདག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། དཀའ་བའི་སྤྱད་པ་སྤྱོད་པ་ཡོད་པར་མི་འདོད་དོ།
en: Venerable Śāradvatīputra, I do not hold that bodhisattva great beings maintain the practice of austerity.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་དཀའ་བ་སྤྱོད་པའི་འདུ་ཤེས་ཀྱིས་མི་སྤྱོད་དོ།
en: Bodhisattva great beings do not engage in it with the perception of hardship.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སྡུག་བསྔལ་གྱི་འདུ་ཤེས་བསྐྱེད་ན། སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པའི་དོན་བྱ་བར་མི་ནུས་ཀྱི།
en: If you ask why, Venerable Śāradvatīputra, when the perception of hardship develops, it will not be possible to act for the benefit of immeasurable, countless beings.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སེམས་ཅན་རྣམས་ལ་མར་འདུ་ཤེས་བསྐྱེད་པ་དང་། ཕར་འདུ་ཤེས་བསྐྱེད་པ་དང་། བདག་ཏུ་འདུ་ཤེས་བསྐྱེད་པ་དང་། བུར་འདུ་ཤེས་བསྐྱེད་པས། སེམས་ཅན་གྲངས་མེད་ཚད་མེད་པའི་དོན་བྱ་བ་དེ་ཡང་མི་དམིགས་པའི་ཚུལ་དུ་ནུས་པར་འགྱུར་རོ།
en: On the contrary, Venerable Śāradvatīputra, by developing the perception of beings as their mother, the perception [of beings] as their father, the perception [of beings] as themselves, and the perception [of beings] as their child, they are capable of acting for the benefit of immeasurable, countless beings, without apprehending anything.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འདི་ལྟར་སེམས་བསྐྱེད་དེ།
en: Bodhisattva great beings set their minds on enlightenment in that manner.

source: ཇི་ལྟར་བདག་བདག་ཅེས་བྱ་བ་ཡང་དེ་ནི་ཐམས་ཅད་དུ་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་མེད་ཅིང་མི་དམིགས་པ་དེ་བཞིན་དུ་ཕྱི་ནང་གི་ཆོས་རྣམས་ལ་ཡང་འདུ་ཤེས་བསྐྱེད་དེ།
en: Just as the notion of individual selves is entirely nonexistent in all respects, and is nonapprehensible, in the same manner they should develop this perception with regard to all inner and outer phenomena.

source: དེ་ལྟར་འདུ་ཤེས་བསྐྱེད་ཀྱང་དགའ་བའི་འདུ་ཤེས་མི་བསྐྱེད་དོ།
en: Having developed their perceptions in that manner, the notion of hardship will not arise.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེ་ནི་ཆོས་གང་ཡང་མི་ལེན་མི་གནས་པའི་ཕྱིར་རོ།
en: If you ask why, it is because they neither acquire nor do they maintain any phenomena. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བདག་ནི་མ་སྐྱེས་པ་ལ་དེ་བཞིན་གཤེགས་པ་ཡོད་པར་མི་འདོད་དོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་ཡོད་པར་མི་འདོད་དོ།
en: Venerable Śāradvatīputra, I do not hold that in nonarising there are tathāgatas, nor do I hold that unsurpassed, complete enlightenment is to be brought into being in it.

source: །དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ལྟར་ན། མ་སྐྱེས་པའི་ཆོས་ཀྱིས་འཐོབ་པའམ་འཐོབ་པར་བྱ་བ་མེད་དོ།
en: If the tathāgatas were to turn the wheel of the Dharma, there is nothing at all that would be obtained or that should be attained on the basis of phenomena that are nonarising.” “

source: །སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཁྱོད་ཆོས་སྐྱེས་པས་འཐོབ་པར་འདོད་དམ། འོན་ཏམ་མ་སྐྱེས་པའི་ཆོས་ཀྱིས་འཐོབ་པར་འདོད།
en: Venerable Subhūti, do you hold that attainment will ensue on the basis of phenomena that are arising, or else do you hold that attainment will ensue on the basis of phenomena that are nonarising?” {

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བདག་ནི་སྐྱེས་པའི་ཆོས་ཀྱིས་ཀྱང་འཐོབ་པར་ཡང་མི་འདོད་དོ། །མ་སྐྱེས་པའི་ཆོས་ཀྱིས་ཀྱང་འཐོབ་པར་མི་འདོད་དོ།
en: Dt.261} “Venerable Śāradvatīputra,” replied Subhūti, “I do not hold that attainment will ensue on the basis of phenomena that are arising, nor do I hold that attainment will ensue on the basis of phenomena that are nonarising.” “

source: །སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་འོ་ན་འཐོབ་པ་མེད་ལ་མངོན་པར་རྟོགས་པ་མེད་དམ།
en: Venerable Subhūti, is there no attainment? Is there no clear realization?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འཐོབ་པར་ཡང་ཡོད། མངོན་པར་རྟོགས་པ་ཡང་ཡོད་དེ། གཉིས་ཀྱིས་མ་ཡིན་གྱི།
en: Venerable Śāradvatīputra, there is indeed attainment and there is clear realization, but not on the basis of either of those two.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འཐོབ་པའམ་མངོན་པར་རྟོགས་པ་ནི་འཇིག་རྟེན་གྱི་ཐ་སྙད་ཀྱིས་གདགས་པའོ། །རྒྱུན་དུ་ཞུགས་པའམ། ལན་ཅིག་ཕྱིར་འོང་བའམ།
en: Yet, Venerable Śāradvatīputra, attainment or clear realization is designated in accordance with worldly conventions.

source: ཕྱིར་མི་འོང་བའམ། དགྲ་བཅོམ་པའམ། རང་སངས་རྒྱས་སམ། བྱང་ཆུབ་སེམས་དཔའ་འམ། སངས་རྒྱས་དག་ཀྱང་འཇིག་རྟེན་གྱི་ཐ་སྙད་ཀྱིས་གདགས་པ་སྟེ།
en: Those entering the stream to nirvāṇa, those destined for only one more rebirth, those who will no longer be reborn, arhats, pratyekabuddhas, bodhisattvas, and buddhas are also designated according to worldly convention.

source: དོན་དམ་པར་ནི་འཐོབ་པའམ། མངོན་པར་རྟོགས་པའམ། རྒྱུན་དུ་ཞུགས་པའམ། ལན་ཅིག་ཕྱིར་འོང་བའམ། ཕྱིར་མི་འོང་བའམ། དགྲ་བཅོམ་པའམ།
en: But, ultimately, there is nothing that is designated as attainment or clear realization; or individuals entering the stream to nirvāṇa, destined for only one more rebirth, or no longer subject to rebirth; or arhats, pratyekabuddhas, bodhisattvas, or buddhas.” {

source: རང་སངས་རྒྱས་སམ། བྱང་ཆུབ་སེམས་དཔའ་འམ། སངས་རྒྱས་སུ་གདགས་པ་མེད་དོ། །སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཐོབ་པ་དང་། མངོན་པར་རྟོགས་པར་བྱ་བ་འཇིག་རྟེན་གྱི་ཐ་སྙད་དུ་ཡོད་པ་དེ་བཞིན་དུ་འགྲོ་བ་ལྔ་དག་ཀྱང་འཇིག་རྟེན་གྱི་ཐ་སྙད་དུ་ཐ་དད་ཀྱི་དོན་དམ་པར་མ་ཡིན་ནམ།
en: Dt.262} “Venerable Subhūti, as attainment and clear realization are designated according to worldly convention, is it the case that the five classes of living beings are also differentiated owing to worldly convention but not in ultimate reality?” “

source: སྨྲས་པ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ཏེ།
en: Venerable Śāradvatīputra, that is so!

source: ཇི་ལྟར་ཐོབ་པ་དང་། མངོན་པར་རྟོགས་པ་འཇིག་རྟེན་གྱི་ཐ་སྙད་དུ་ཡོད་པ་དེ་བཞིན་དུ་འགྲོ་བ་ལྔ་དག་ཀྱང་འཇིག་རྟེན་གྱི་ཐ་སྙད་དུ་ཐ་དད་ཀྱི་དོན་དམ་པར་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Just as attainment and clear realization are designated according to worldly convention, it is the case that the five classes of living beings also are differentiated owing to worldly convention but not in ultimate reality.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དོན་དམ་པར་ནི་ལས་ཀྱང་མེད། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ཡང་མེད། སྐྱེ་བ་ཡང་མེད། འགག་པ་ཡང་མེད། ཀུན་ནས་ཉོན་མོངས་པ་ཡང་མེད།
en: If you ask why, Venerable Śāradvatīputra, in ultimate reality there are no past actions, no ripening of past actions, no arising, no ceasing, no affliction, and no purification.” “

source: རྣམ་པར་བྱང་བ་ཡང་མེད་དོ། །སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་མ་སྐྱེས་པའི་ཆོས་སྐྱེ་བར་འགྱུར་རམ།
en: Venerable Subhūti, do nonarising phenomena arise, or else do arising phenomena arise?” “

source: འོན་ཏམ་སྐྱེས་པའི་ཆོས་སྐྱེ་བར་འགྱུར། རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བདག་ནི་མ་སྐྱེས་པའི་ཆོས་ཀྱང་སྐྱེ་བར་མི་འདོད་དོ། །སྐྱེས་པའི་ཆོས་ཀྱང་སྐྱེ་བར་མི་འདོད་དོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ།
en: Venerable Śāradvatīputra,” replied Subhūti, “I do not hold that nonarising phenomena arise, nor do I hold that arising phenomena arise.” “

source: བམ་པོ་ཉི་ཤུ་དྲུག་པ། སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་མ་སྐྱེས་པའི་ཆོས་སྐྱེ་བར་མི་འདོད་པ་གང་ཡིན།
en: Venerable Subhūti, what nonarising phenomena do you hold not to arise?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བདག་ནི་གཟུགས་མ་སྐྱེས་པ་རང་བཞིན་གྱིས་སྟོང་པ་སྐྱེ་བར་མི་འདོད་དོ།
en: Venerable Śāradvatīputra, I do not hold that nonarising physical forms, which are empty of inherent existence, arise.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བདག་ནི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མ་སྐྱེས་པ་རང་བཞིན་གྱིས་སྟོང་པ་སྐྱེ་བར་མི་འདོད་དོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བདག་ནི་སྐྱེ་མཆེད་རྣམས་དང་། ཁམས་རྣམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་རྣམས་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: Venerable Śāradvatīputra, I do not hold that nonarising feelings, perceptions, formative predispositions, and consciousness, which are empty of inherent existence, arise.

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་།
en: Venerable Śāradvatīputra, I do not hold that the nonarising sense fields, sensory elements, links of dependent origination, perfections, factors conducive to enlightenment, truths of the noble ones, meditative concentrations, immeasurable attitudes, formless absorptions, aspects of liberation, serial steps of meditative absorption, gateways to liberation—emptiness, signlessness, and wishlessness—extrasensory powers, meditative stabilities, dhāraṇī gateways, powers of the tathāgatas, fearlessnesses, kinds of exact knowledge, and distinct qualities of the buddhas, which are empty of inherent existence, arise.

source: མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་མ་སྐྱེས་པ་རང་བཞིན་གྱིས་སྟོང་པ་སྐྱེ་བར་མི་འདོད་དོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བདག་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མ་སྐྱེས་པ་རང་བཞིན་གྱིས་སྟོང་པ་སྐྱེ་བར་མི་འདོད་དོ།
en: Venerable Śāradvatīputra, I do not hold that the nonarising [spiritual goals], up to and including all-aspect omniscience, which are empty of inherent existence, arise.” “

source: །སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཆོས་སྐྱེས་པ་སྐྱེ་བར་མི་འདོད་པ་གང་།
en: Venerable Subhūti, what arising phenomena do you hold not to arise?” “

source: སྨྲས་པ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བདག་ནི་གཟུགས་སྐྱེས་པ་རང་བཞིན་གྱིས་སྟོང་པ་སྐྱེ་བར་མི་འདོད་དོ།
en: Venerable Śāradvatīputra, I do not hold that arising physical forms, which are empty of inherent existence, arise.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བདག་ནི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་སྐྱེས་པ། རང་བཞིན་གྱིས་སྟོང་པ་སྐྱེ་བར་མི་འདོད་དོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བདག་ནི་སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་རྣམས་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་།
en: Venerable Śāradvatīputra, I do not hold that arising feelings, perceptions, formative predispositions, and consciousness, which are empty of inherent existence, arise.

source: སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སྐྱེས་པ་རང་བཞིན་གྱིས་སྟོང་པ་སྐྱེ་བར་མི་འདོད་དོ།
en: Venerable Śāradvatīputra, I do not hold that arising sense fields, sensory elements, links of dependent origination, perfections, factors conducive to enlightenment, truths of the noble ones, meditative concentrations, immeasurable attitudes, formless absorptions, aspects of liberation, serial steps of meditative absorption, gateways to liberation—emptiness, signlessness, and wishlessness—extrasensory powers, meditative stabilities, dhāraṇī gateways, powers of the tathāgatas, fearlessnesses, kinds of exact knowledge, and distinct qualities of the buddhas, which are empty of inherent existence, arise.
